In [2]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date']) # cleaning up the job_posted_date column. Converting to datetime

In [4]:
df.sample(5)  # Displaying a random sample of 5 rows from the DataFrame to verify data loading and cleanup

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
260110,Data Engineer,Lead Data Engineer (Ведущий дата-инженер),"Moscow, Russia",via hh.ru,Full-time,False,Russia,2023-12-11 07:52:32,True,False,Russia,None,NaN,NaN,ФГБУ Центральный НИИ организации и информатиза...,"['sql', 'r', 'python']","{'programming': ['sql', 'r', 'python']}"
452180,Data Analyst,Data Analyst,Singapore,via Recruitment & HR Outsourcing | OneHR Solut...,Full-time,False,Singapore,2023-05-28 14:40:46,False,False,Singapore,None,NaN,NaN,Hatch Asia Consulting,"['sql', 'python', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."
628001,Data Analyst,Data Analyst - Real World,"Madrid, Spain",via Indeed,Full-time,False,Spain,2023-08-04 12:25:14,False,False,Spain,None,NaN,NaN,IQVIA,"['sas', 'sas', 'python', 'sql', 'r']","{'analyst_tools': ['sas'], 'programming': ['sa..."
446141,Data Scientist,Data Scientist H/F (IT) / Freelance,"Paris, France",via Indeed,Full-time,False,France,2023-09-08 16:55:09,False,False,France,None,NaN,NaN,LeHibou,None,None
430673,Business Analyst,Marketing Analyst,Greece,via LinkedIn,Full-time,False,Greece,2023-08-02 16:42:03,False,False,Greece,None,NaN,NaN,Motodynamics,"['go', 'excel', 'power bi']","{'analyst_tools': ['excel', 'power bi'], 'prog..."

In [ ]:
# Inspect the index, which is just numbers. It's a RangeIndex going frpm 0 to the last row.
df.index

RangeIndex(start=0, stop=785741, step=1)

In [ ]:
# Inspecting the name of the index. It has no name currently.
df.index.name = 'job_index' # Attributes is basically just a variable that is associated with an object. Here, name is an attribute of the index object; or just a variable holder. A name, in this case, 'job_index' can be assigned to the index.

In [11]:
df.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
job_index,,,,,,,,,,,,,,,,,
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [12]:
# Investigating the items. Another attributes to look at is the data types.
df.index.dtype

dtype('int64')

# Methods to Cover

- df.reset_index()
- df.set_index()
- df.sort_index()

In [ ]:
# df.reset_index() Filter for jobs particular to a particular place. It basically resets the index to default integer index.
df_usa = df[df['job_location'] == 'United States']

df_usa.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
job_index,,,,,,,,,,,,,,,,,
26,Data Engineer,Data Engineer,United States,via LinkedIn,Full-time,False,Georgia,2023-09-15 13:56:18,True,False,United States,None,NaN,NaN,Infinite Computer Solutions,None,None
156,Data Engineer,Data Engineer,United States,via BeBee,Full-time,False,Sudan,2023-11-18 14:20:00,False,False,Sudan,None,NaN,NaN,Tech Tammina,"['sql', 'excel']","{'analyst_tools': ['excel'], 'programming': ['..."
339,Data Engineer,Global Market Leading Energy Firm - Staff Data...,United States,via LinkedIn,Full-time,False,"California, United States",2023-09-22 13:07:57,False,False,United States,year,195000.0,NaN,Xcede,None,None
372,Data Scientist,Data Scientist/Analyst,United States,via Trabajo.org,Full-time,False,"Texas, United States",2023-03-25 13:05:35,False,False,United States,None,NaN,NaN,Peraton,['python'],{'programming': ['python']}
572,Data Scientist,Data Scientist I,United States,via BeBee,Full-time,False,Sudan,2023-08-21 13:38:16,False,False,Sudan,None,NaN,NaN,MasterCard,"['python', 'r', 'sql', 'hadoop', 'spark', 'ten...","{'libraries': ['hadoop', 'spark', 'tensorflow'..."

In [ ]:
df_usa.reset_index(inplace=True) # Resetting the index inplace so that the changes are made to the existing DataFrame rather than creating a new one. We've kept the job_index, but we now have a new default integer index.

df_usa

,job_index,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,26,Data Engineer,Data Engineer,United States,via LinkedIn,Full-time,False,Georgia,2023-09-15 13:56:18,True,False,United States,None,NaN,NaN,Infinite Computer Solutions,None,None
1,156,Data Engineer,Data Engineer,United States,via BeBee,Full-time,False,Sudan,2023-11-18 14:20:00,False,False,Sudan,None,NaN,NaN,Tech Tammina,"['sql', 'excel']","{'analyst_tools': ['excel'], 'programming': ['..."
2,339,Data Engineer,Global Market Leading Energy Firm - Staff Data...,United States,via LinkedIn,Full-time,False,"California, United States",2023-09-22 13:07:57,False,False,United States,year,195000.0,NaN,Xcede,None,None
3,372,Data Scientist,Data Scientist/Analyst,United States,via Trabajo.org,Full-time,False,"Texas, United States",2023-03-25 13:05:35,False,False,United States,None,NaN,NaN,Peraton,['python'],{'programming': ['python']}
4,572,Data Scientist,Data Scientist I,United States,via BeBee,Full-time,False,Sudan,2023-08-21 13:38:16,False,False,Sudan,None,NaN,NaN,MasterCard,"['python', 'r', 'sql', 'hadoop', 'spark', 'ten...","{'libraries': ['hadoop', 'spark', 'tensorflow'..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7449,785117,Data Scientist,Sr. Data Scientist,United States,via BeBee,Contractor,False,"Texas, United States",2023-01-13 06:06:28,False,False,United States,None,NaN,NaN,"Talent Software Services, Inc.","['python', 'sql', 'mongo', 'oracle']","{'cloud': ['oracle'], 'programming': ['python'..."
7450,785156,Data Scientist,Data Scientist 2,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:23,False,False,United States,None,NaN,NaN,"TalentBurst, Inc.","['r', 'sql', 'snowflake']","{'cloud': ['snowflake'], 'programming': ['r', ..."
7451,785192,Data Scientist,Data Scientist,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:21,False,False,United States,None,NaN,NaN,SMX USA,"['sql', 'python', 'scala']","{'programming': ['sql', 'python', 'scala']}"
7452,785346,Data Scientist,Data Scientist with Security Clearance,United States,via Jobs Trabajo.org,Full-time,False,"Texas, United States",2023-12-14 06:04:56,False,False,United States,None,NaN,NaN,SAIC,"['sql', 't-sql', 'python', 'java', 'c#', 'r', ...","{'analyst_tools': ['tableau'], 'libraries': ['..."
7453,785557,Data Scientist,"Data Scientist, All Levels",United States,via Trabajo.org,Full-time,False,Sudan,2023-10-13 07:15:15,False,True,Sudan,None,NaN,NaN,Independent Software,"['python', 'c', 'shell', 'bash', 'perl']","{'programming': ['python', 'c', 'shell', 'bash..."

In [ ]:
# df.set_index('job_index') Setting the job_index column as the index for the df_usa DataFrame. You lose data sometimes when you use set_index, so it's better to do it inplace.
df_usa.set_index('job_index', inplace=True)

In [19]:
df_usa

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
job_index,,,,,,,,,,,,,,,,,
26,Data Engineer,Data Engineer,United States,via LinkedIn,Full-time,False,Georgia,2023-09-15 13:56:18,True,False,United States,None,NaN,NaN,Infinite Computer Solutions,None,None
156,Data Engineer,Data Engineer,United States,via BeBee,Full-time,False,Sudan,2023-11-18 14:20:00,False,False,Sudan,None,NaN,NaN,Tech Tammina,"['sql', 'excel']","{'analyst_tools': ['excel'], 'programming': ['..."
339,Data Engineer,Global Market Leading Energy Firm - Staff Data...,United States,via LinkedIn,Full-time,False,"California, United States",2023-09-22 13:07:57,False,False,United States,year,195000.0,NaN,Xcede,None,None
372,Data Scientist,Data Scientist/Analyst,United States,via Trabajo.org,Full-time,False,"Texas, United States",2023-03-25 13:05:35,False,False,United States,None,NaN,NaN,Peraton,['python'],{'programming': ['python']}
572,Data Scientist,Data Scientist I,United States,via BeBee,Full-time,False,Sudan,2023-08-21 13:38:16,False,False,Sudan,None,NaN,NaN,MasterCard,"['python', 'r', 'sql', 'hadoop', 'spark', 'ten...","{'libraries': ['hadoop', 'spark', 'tensorflow'..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785117,Data Scientist,Sr. Data Scientist,United States,via BeBee,Contractor,False,"Texas, United States",2023-01-13 06:06:28,False,False,United States,None,NaN,NaN,"Talent Software Services, Inc.","['python', 'sql', 'mongo', 'oracle']","{'cloud': ['oracle'], 'programming': ['python'..."
785156,Data Scientist,Data Scientist 2,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:23,False,False,United States,None,NaN,NaN,"TalentBurst, Inc.","['r', 'sql', 'snowflake']","{'cloud': ['snowflake'], 'programming': ['r', ..."
785192,Data Scientist,Data Scientist,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:21,False,False,United States,None,NaN,NaN,SMX USA,"['sql', 'python', 'scala']","{'programming': ['sql', 'python', 'scala']}"
785346,Data Scientist,Data Scientist with Security Clearance,United States,via Jobs Trabajo.org,Full-time,False,"Texas, United States",2023-12-14 06:04:56,False,False,United States,None,NaN,NaN,SAIC,"['sql', 't-sql', 'python', 'java', 'c#', 'r', ...","{'analyst_tools': ['tableau'], 'libraries': ['..."
785557,Data Scientist,"Data Scientist, All Levels",United States,via Trabajo.org,Full-time,False,Sudan,2023-10-13 07:15:15,False,True,Sudan,None,NaN,NaN,Independent Software,"['python', 'c', 'shell', 'bash', 'perl']","{'programming': ['python', 'c', 'shell', 'bash..."

In [ ]:
# df.sort_index() Returns a new DataFrame sorted by a label. It's sorting the index, so you don't need to specify the column name.

median_pivot = df_usa.pivot_table(values='salary_year_avg', index='job_title_short', aggfunc=['median', 'min', 'max'])

In [21]:
median_pivot

                                   median             min             max
                          salary_year_avg salary_year_avg salary_year_avg
job_title_short
Business Analyst                 100000.0        100000.0        100000.0
Cloud Engineer                    58000.5         58000.5         58000.5
Data Analyst                      89500.0         52500.0        220000.0
Data Engineer                    127500.0         62500.0        269500.0
Data Scientist                   131280.0         33488.5        351500.0
Machine Learning Engineer        169250.0         99150.0        270000.0
Senior Data Analyst              119450.0         98500.0        240000.0
Senior Data Engineer             154000.0         95000.0        375000.0
Senior Data Scientist            163000.0         76750.0        273555.0
Software Engineer                191000.0        125000.0        217500.0

In [23]:
median_pivot.sort_values(by=('median', 'salary_year_avg'), ascending=False)

                                   median             min             max
                          salary_year_avg salary_year_avg salary_year_avg
job_title_short
Software Engineer                191000.0        125000.0        217500.0
Machine Learning Engineer        169250.0         99150.0        270000.0
Senior Data Scientist            163000.0         76750.0        273555.0
Senior Data Engineer             154000.0         95000.0        375000.0
Data Scientist                   131280.0         33488.5        351500.0
Data Engineer                    127500.0         62500.0        269500.0
Senior Data Analyst              119450.0         98500.0        240000.0
Business Analyst                 100000.0        100000.0        100000.0
Data Analyst                      89500.0         52500.0        220000.0
Cloud Engineer                    58000.5         58000.5         58000.5

In [26]:
median_pivot.sort_index(inplace=True)

median_pivot

                                   median             min             max
                          salary_year_avg salary_year_avg salary_year_avg
job_title_short
Business Analyst                 100000.0        100000.0        100000.0
Cloud Engineer                    58000.5         58000.5         58000.5
Data Analyst                      89500.0         52500.0        220000.0
Data Engineer                    127500.0         62500.0        269500.0
Data Scientist                   131280.0         33488.5        351500.0
Machine Learning Engineer        169250.0         99150.0        270000.0
Senior Data Analyst              119450.0         98500.0        240000.0
Senior Data Engineer             154000.0         95000.0        375000.0
Senior Data Scientist            163000.0         76750.0        273555.0
Software Engineer                191000.0        125000.0        217500.0